content/posts/20200923141318-so.md
+++
title = "SO"
author = ["Daniel Biasiotto"]
draft = false
+++

Mail Prof: `daniele.radicioni@unito.it`
<span class="underline">12 Crediti</span>

Informazioni corso

-   Scritto
-   Orale facoltativo - per la Lode


## [Teoria]({{< relref "SO.md" >}}) {#teoria--so-dot-md}


## [Unix]({{< relref "20200929150510-unix.md" >}}) {#unix--20200929150510-unix-dot-md}

-   The Linux Programming Interface


### Introduzione {#introduzione}


#### Anni '60 {#anni-60}


#### 2 Kernel Originari {#2-kernel-originari}

<!--list-separator-->

-  AT&amp;T

<!--list-separator-->

-  BSD


#### Richard Stallman lancia lo GNU Project `1983` {#richard-stallman-lancia-lo-gnu-project-1983}

Free as in Freedom, il punto non e' sulla gratuita'

-   E' ispezionabile


#### Per un uso didattico basta un sistema discendente da System5 {#per-un-uso-didattico-basta-un-sistema-discendente-da-system5}


#### Linus Torvalds, inizia a lavorare su Linux - Unix-like `1991` {#linus-torvalds-inizia-a-lavorare-su-linux-unix-like-1991}

Progressive Licensing ~ software distrubuibile gratuitamente

<!--list-separator-->

-  Linux e' il kernel


#### OS {#os}

strato che mette in comunicazione utente e hardware

<!--list-separator-->

-  Kernel

    strato piu' basso

    -   composto di funzioni autonome
        -   non utilizzate direttamente dall'utente

    <!--list-separator-->

    -  Permette l'accesso all'hardware

    <!--list-separator-->

    -  Device

    <!--list-separator-->

    -  Processi

        Sono programmi in esecuzione

        <!--list-separator-->

        -  un kernel facilita la creazione e la gestione dei processi

        <!--list-separator-->

        -  Fork

            System call

            -   crea una seconda linea di computazione

            <!--list-separator-->

            -  crezioni di processi

                Processi possono creare altri processi

                <!--list-separator-->

                -  Genitori

                <!--list-separator-->

                -  Figli

            <!--list-separator-->

            -  biforcazione della linea di computazione

        <!--list-separator-->

        -  Comunicazione tra Processi

            per permetterne la collaborazione

    <!--list-separator-->

    -  Gestione della Memoria

        <!--list-separator-->

        -  Virtualizzazione della Memoria

            spostamento parti di processi in Memoria Secondaria

            -   poi ripresa attraverso `paging`

            <!--list-separator-->

            -  Swap

                spostamento di interi processi nella memoria secondaria

    <!--list-separator-->

    -  Operazioni sul Filesystem

    <!--list-separator-->

    -  Un kernel e' construito per un hardware specifico

<!--list-separator-->

-  Shell

    <!--list-separator-->

    -  interprete di comandi

    <!--list-separator-->

    -  permette l'interazione utente - sistema

    <!--list-separator-->

    -  oggetto utilizzato per l'amministrazione della macchina

        $ cat /etc/shells

        $ tar cvzf foo.tgz cps100
        $ tar xvzf foo.tgz

<!--list-separator-->

-  Filesystem

    Visione astratta che visualizza il contenuto della memoria secondaria della macchina

    -   e' un albero
        -   bin/
            applicazioni condivise
        -   etc/
            configurazione
        -   home/
            directories degli utenti
        -   lib/
            librerie necessarie agli utenti
        -   opt/
            third party software
        -   tmp/
            spazio temporaneo
        -   usr/
            spazio programmi degli utenti

    <!--list-separator-->

    -  permette all'utente di

        <!--list-separator-->

        -  visualizzare

        <!--list-separator-->

        -  organizzare

        <!--list-separator-->

        -  interagire le directories della macchina

<!--list-separator-->

-  Applicazioni

    comandi, parti

    <!--list-separator-->

    -  Comandi

        -   comando
        -   argomenti
        -   flag
            con o senza dash che li preceda

        <!--list-separator-->

        -  tar

        <!--list-separator-->

        -  man

            &gt;man 1 command

            -   Possibile specificare la sezione con numero

        <!--list-separator-->

        -  grep

            global regular expression print

            -   cerca pattern

        <!--list-separator-->

        -  tail

        <!--list-separator-->

        -  head

        <!--list-separator-->

        -  less

        <!--list-separator-->

        -  more

        <!--list-separator-->

        -  mv

        <!--list-separator-->

        -  rm

        <!--list-separator-->

        -  cp

        <!--list-separator-->

        -  Metacharacter

            wildcards

            -   ? qualsiasi carattere 1 volta
            -   \* carattere 0 o piu'
            -   [ ] match tra uno dei caratteri specificati

        <!--list-separator-->

        -  Input Output Redirection

            redirigere l'output
            $ ls &gt; out.org
                sovrascrive
            $ ls &gt;&gt; out.org
                preserva il contenuto precedente

            cambiare l'input
            $ sort &lt; terms &gt; terms-alpha
                sort prende terms e scrive in terms-alpha

        <!--list-separator-->

        -  Pipes

            Operatore che combina input e output redirection

            -   l'output di un programma viene utilizzato come input ad un altro programma

            &gt; echo $SHELL

<!--list-separator-->

-  Filosofia

    <!--list-separator-->

    -  Semplicita'

        ciascun componente deve essere breve

    <!--list-separator-->

    -  Focus

        fare una cosa bene

        -   piu' semplice da mantenere

    <!--list-separator-->

    -  Componenti Riutilizzabili

    <!--list-separator-->

    -  Filtri

        strumenti che trasformano l'input in un output

    <!--list-separator-->

    -  File in formati aperti

        UTF8 ~ UTF16

    <!--list-separator-->

    -  Flessibilita'

        Evitare limiti arbitrari

<!--list-separator-->

-  Account

    Privilegi dei vari account

    <!--list-separator-->

    -  root

        completo controllo

        -   puo' distruggere il sistema
        -   e' dato per scontato che si abbia conoscenza dei pericoli

    <!--list-separator-->

    -  system

    <!--list-separator-->

    -  utente

        -   nomi
            -   si usavano al piu' di 8 caratteri
        -   poco accesso

    <!--list-separator-->

    -  Gruppi

        ogni file ha permessi per:

        -   owner
        -   gruppo
        -   altri

        Consentono il controllo di accessi su parti diverse della macchina in una macchina condivisa

    <!--list-separator-->

    -  Permessi

        il superutente o il proprietario di una risorsa puo' cambiarne la proprieta'

        &gt; chown jane _home/bin_
        &gt; ls -l //formato long
            -rwxrwx---

        -   la sequenza e':
            -   in prima posizione indica il tipo di file
                -   directory
                -   fifo
            -   poi si susseguono 3 blocchi da 3
                -   permessi utente
                -   permessi gruppo
                -   permessi altri

        Cambio Permessi
        &gt; chmod o+wr myfile //symbolic mode
            aggiunge write e execute permission a others
        &gt; chmod 754 myfile  //absolute mode

        -   absolute
            -   ogni numero indica il valore in binario dei permessi di ogni gruppo(owner|group|others)

        <!--list-separator-->

        -  Tipi di permessi

            <!--list-separator-->

            -  r

            <!--list-separator-->

            -  w

            <!--list-separator-->

            -  e

        <!--list-separator-->

        -  utenti

            <!--list-separator-->

            -  u

            <!--list-separator-->

            -  g

            <!--list-separator-->

            -  o


### Integrazione C {#integrazione-c}


### Controllo dei processi {#controllo-dei-processi}


### Segnali {#segnali}


### Pipe e Fifo {#pipe-e-fifo}


### Code di messaggi {#code-di-messaggi}


### Memoria Condivisa {#memoria-condivisa}


### Semafori {#semafori}


### Bash {#bash}


## [C]({{< relref "20200929150429-c.md" >}}) {#c--20200929150429-c-dot-md}


## Esercitazioni {#esercitazioni}

La sua discussione permette l'accesso allo Scritto (5 scritti all'anno)

-   almeno 10 giorni di anticipo per la consegna, inviato ai professori dei turni corrispondenti ai partecipanti
-   preferibilmente fuori dalla finestra esami

Progetto Individuale o di Gruppo (max 3)

Una volta completato chiedere con mail al professore del corso di Teoria di poter sostenere l'esame scritto, eventualmente l'orale


### Novembre {#novembre}


### Sorgenti {#sorgenti}


### Breve Relazione {#breve-relazione}

Nome Cognome - Matricola - Mail